# 01.09 Introduction to Pandas

## Plan
- Data Frames
- Series
- Index
- Accessing elements
- Element-wise operations
- Filtering
- String operations
- Summarizing operations
- Missing values
- Grouping
- Getting the NumPy arrays

## Setup

In [227]:
import numpy as np
import pandas as pd

## Data frames

In [228]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

# Show the current data set
df = pd.DataFrame(data, columns=columns)
print("DataFrame from list:")
df

DataFrame from list:

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [229]:
df.sample(n=2)  # Randomly sample 2 rows from the DataFrame

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [230]:
df.Make  # Access the 'Make' column of the DataFrame

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [231]:
df['Engine HP']  # Access the 'Engine HP' column of the DataFrame using bracket notation

0    138.0
1      NaN
2    218.0
3    194.0
4    261.0
Name: Engine HP, dtype: float64

In [232]:
df[['Make', 'Model', 'MSRP']]  # Access multiple columns

      Make     Model   MSRP
0   Nissan    Stanza   2000
1  Hyundai    Sonata  27150
2    Lotus     Elise  54990
3      GMC    Acadia  34450
4   Nissan  Frontier  32340

In [233]:
# Add a new column 'id' with sequential integers
df['id'] = np.arange(len(df)) + 1
print("\nDataFrame after adding 'id' column:")
df

DataFrame after adding 'id' column:

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [234]:
del df['id']  # Remove the 'id' column
print("\nDataFrame after deleting 'id' column:")
df

DataFrame after deleting 'id' column:

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

## Index

In [235]:
df.index  # Show the index of the DataFrame

RangeIndex(start=0, stop=5, step=1)

In [236]:
df.Make.index  # Show the index of the 'Make' column

RangeIndex(start=0, stop=5, step=1)

In [237]:
df.loc[0]  # Access the first row using .loc

Make                 Nissan
Model                Stanza
Year                   1991
Engine HP             138.0
Engine Cylinders          4
Transmission Type    MANUAL
Vehicle_Style         sedan
MSRP                   2000
Name: 0, dtype: object

In [238]:
df.loc[[1, 3]]  # Access rows with index 1 and 3 using .loc (Hyundai, GMC)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

In [239]:
# Set custom index labels
df.index = ['a', 'b', 'c', 'd', 'e']
print("\nDataFrame after setting custom index:")
df

DataFrame after setting custom index:

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [240]:
# df.loc[0] # Access the first row using .loc
# This will raise a KeyError since the index labels are now 'a', 'b', 'c', 'd', 'e'

In [241]:
# Access rows with index labels 'b' and 'c' using .loc (Hyundai, Lotus)
df.loc[['b', 'c']]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990

In [242]:
# You can still access rows by their integer position using .iloc
df.iloc[[1, 2]]  # Access rows by integer position using .iloc (Hyundai, Lotus)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990

In [243]:
# Reset index to default integer index
# drop=True removes the old index
# inplace=True modifies the original DataFrame
print("\nDataFrame after resetting index (not in place):")
df.reset_index(drop=True, inplace=True)  # Reset index to default integer index

DataFrame after resetting index (not in place):

## Element-wise operations

In [244]:
df['Engine HP'] / 100  # Divide the 'Engine HP' column by 100

0    1.38
1     NaN
2    2.18
3    1.94
4    2.61
Name: Engine HP, dtype: float64

## Filtering

In [245]:
# Boolean mask for rows where 'Year' is greater than or equal to 2015
df['Year'] >= 2015

0    False
1     True
2    False
3     True
4     True
Name: Year, dtype: bool

In [246]:
df[
    df['Year'] >= 2015
]  # Filter DataFrame for rows where 'Year' is greater than or equal to 2015

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [247]:
df[
    (df['Make'] == 'Nissan') & (df['Year'] >= 2015)
]  # Filter for Nissan cars from year 2015 or later

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

## String operations

In [248]:
df['Vehicle_Style']

0          sedan
1          Sedan
2    convertible
3        4dr SUV
4         Pickup
Name: Vehicle_Style, dtype: object

In [249]:
'STRing'.lower()  # Convert string to lowercase

'string'

In [250]:
df['Vehicle_Style'].str.lower()  # Convert 'Vehicle_Style' column to lowercase

0          sedan
1          sedan
2    convertible
3        4dr suv
4         pickup
Name: Vehicle_Style, dtype: object

In [251]:
# Replace spaces with underscores in a string
'machine learning zoomcamp'.replace(' ', '_')

'machine_learning_zoomcamp'

In [252]:
# Replace spaces with underscores in 'Vehicle_Style' column after converting to lowercase
df['Vehicle_Style'] = df['Vehicle_Style'] \
    .str.replace(' ', '_') \
    .str.lower()
# Make sure to always access the string methods via .str accessor

print("\nDataFrame after modifying 'Vehicle_Style' column:")
df

DataFrame after modifying 'Vehicle_Style' column:

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr_suv,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,pickup,32340

## Summarising operations

In [253]:
df.MSRP.mean()  # Calculate the mean of the 'MSRP' column

np.float64(30186.0)

In [254]:
df.MSRP.describe()  # Get descriptive statistics of the 'MSRP' column

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

In [255]:
# Get descriptive statistics for all numeric columns
df.describe().round(2)  # Round the results to 2 decimal places

          Year  Engine HP  Engine Cylinders      MSRP
count     5.00       4.00              5.00      5.00
mean   2010.40     202.75              4.40  30186.00
std      11.26      51.30              0.89  18985.04
min    1991.00     138.00              4.00   2000.00
25%    2010.00     180.00              4.00  27150.00
50%    2017.00     206.00              4.00  32340.00
75%    2017.00     228.75              4.00  34450.00
max    2017.00     261.00              6.00  54990.00

In [256]:
df.Make.unique()  # Get unique values in the 'Make' column

array(['Nissan', 'Hyundai', 'Lotus', 'GMC'], dtype=object)

In [257]:
df.Make.nunique()  # Get the number of unique values in the 'Make' column

4

In [258]:
df.nunique()  # Get the number of unique values in each column

Make                 4
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle_Style        4
MSRP                 5
dtype: int64

## Missing values
We don't want missing values in machine learning, so knowing where they are in data is vital to know where to clean the data.

In [259]:
df.isnull()  # Check for null values in the DataFrame

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,False,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [260]:
df.isnull().sum()  # Count of null values in each column

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
dtype: int64

## Grouping

In [261]:
# Grouping as in SQL style grouping
# """
# SELECT
#     transmission_type,
#     AVG(MSRP)
# FROM
#     cars
# GROUP BY
#     transmission_type
# """

In [262]:
# Group by 'Transmission Type' and calculate max 'MSRP'
df.groupby('Transmission Type').MSRP.max()

Transmission Type
AUTOMATIC    34450
MANUAL       54990
Name: MSRP, dtype: int64

## Getting the NumPy arrays

In [263]:
df.MSRP.values  # Get the underlying numpy array of the 'MSRP' column

array([ 2000, 27150, 54990, 34450, 32340])

## Convert data frame back to other format

In [264]:
df.to_dict(orient='records')  # Convert DataFrame to a list of dictionaries

[{'Make': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'sedan',
  'MSRP': 2000},
 {'Make': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': 'sedan',
  'MSRP': 27150},
 {'Make': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'convertible',
  'MSRP': 54990},
 {'Make': 'GMC',
  'Model': 'Acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': '4dr_suv',
  'MSRP': 34450},
 {'Make': 'Nissan',
  'Model': 'Frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'pickup',
  'MSRP': 32340}]